# Лабораторная 9. Введение в React

### [Введение в React](https://dmitryweiner.github.io/web-lectures/React%20-%20Basic.html#) 

### Задача 0

Настроить работу с React (с помощью скриптов либо через Webpack)

---

### Задача 1

Написать компонент, выводящий квадрат переданного числа:
```sql
<Square n={3} />
// 9
```
---

### Задача 2

Написать компонент, выводящий только чётные элементы переданного массива:
```sql
<OnlyEven arr={[14, 5, 6, 12, 21, 2]} />
// 14, 6, 12, 2
```

---

### Задачи 3

Написать компонент, отображающий переданную ему температуру воздуха. Если температура ниже нуля, отображаются синие цифры, если выше, то красные:
```sql
<Temperature t={451} />
// красное
```

Стилизовать можно с помощью inline-стилей.
---
